{
  "processed_at": "2026-02-03T18:36:30.605569",
  "source_file": "tickets_export.json",
  "release_summary": "Release 2nd February 2026",
  "ticket_count": 25,
  "product_lines": [
    "Developer Experience 2026",
    "DSP Core PL3",
    "DSP Core PL1",
    "DSP Core PL5",
    "Audiences PL2"
  ],
  "release_versions": {
    "Developer Experience 2026": "Release 6.0",
    "DSP Core PL3": "Release 4.0",
    "DSP Core PL1": "Release 3.0",
    "DSP Core PL5": "Release 6.0",
    "Audiences PL2": "Release 4.0"
  },
  "fix_version_urls": {
    "Developer Experience 2026": "https://deepintent.atlassian.net/projects/DI/versions/17725/tab/release-report-all-issues",
    "DSP Core PL3": "https://deepintent.atlassian.net/projects/DI/versions/17726/tab/release-report-all-issues",
    "DSP Core PL1": "https://deepintent.atlassian.net/projects/DI/versions/16665/tab/release-report-all-issues",
    "DSP Core PL5": "https://deepintent.atlassian.net/projects/DI/versions/17766/tab/release-report-all-issues",
    "Audiences PL2": "https://deepintent.atlassian.net/projects/DI/versions/17649/tab/release-report-all-issues"
  },
  "epic_urls_by_pl": {
    "Developer Experience 2026": {
      "Saarthi Code Reviewer integration across major repositories": "https://deepintent.atlassian.net/browse/DI-87611",
      "Mock Data Enablement for Apache Spark setup with local setup": "https://deepintent.atlassian.net/browse/DI-88192"
    },
    "DSP Core PL3": {
      "Core Chat UI Shell (Cora Tab Only)": "https://deepintent.atlassian.net/browse/DI-86848"
    },
    "DSP Core PL1": {
      "DSP Core PL1 Maintenance Q1 2026": "https://deepintent.atlassian.net/browse/DI-81489",
      "DSP Core PL1 Enhancements Q1 2026": "https://deepintent.atlassian.net/browse/DI-81496",
      "DSP PL1 Enhancements Q4 2025": "https://deepintent.atlassian.net/browse/DI-63608",
      "Forecasting in Ad Groups": "https://deepintent.atlassian.net/browse/DI-68155"
    },
    "DSP Core PL5": {
      "Generic Data Ingestion Framework for Third-Party Verification Partners": "https://deepintent.atlassian.net/browse/DI-88619",
      "DSP PL5 - General Enhancements 1Q26": "https://deepintent.atlassian.net/browse/DI-86333"
    },
    "Audiences PL2": {
      "Audiences PL2 - 2H 2025 Audience Improvements & Client Requests": "https://deepintent.atlassian.net/browse/DI-75222"
    }
  },
  "tldr_by_pl": {
    "Developer Experience 2026": "Enhanced developer productivity by integrating Saarthi across nine core repositories including data-jobs, gateway-service, and planner-ui; upgraded model integration to production OpenWebUI instance with new helper scripts for DCR table schema recreation.",
    "DSP Core PL3": "Enhanced launch capabilities with anonymous client configuration for LaunchDarkly; added Cortex Agent entry point featuring flag-based deployment control for improved system integration.",
    "DSP Core PL1": "Enhanced order management with multi-select status filtering and persistent preferences; added forecasting channel/device/inventory validation logic for deals; patched critical vulnerability and integrated pixel audience data in Clickhouse.",
    "DSP Core PL5": "Enhanced rate migration system with updated Peer39 2026 pricing rules; added order activation controls preventing seat separation from Boostr IO integration.",
    "Audiences PL2": "Enhanced security infrastructure by adding dedicated IAM user/role for match-service-cron with proper access controls and automated scheduling capabilities."
  },
  "body_by_pl": {
    "Developer Experience 2026": "Saarthi Code Reviewer Integration Across Major Repositories\n\nValue Add:\n• Developers now have automated code review capabilities integrated across all critical repositories including data-jobs, developer-ui, media-reporting-service, and reporting-service.\n• Engineering teams benefit from consistent code quality standards and faster review cycles through AI-powered analysis across gateway-service, planner-ui, patient-planner-service, and common-service repositories.\n• Production-ready OpenWebUI model integration ensures reliable and scalable code review automation for enterprise development workflows.\n\nGeneral Availability\n\nMock Data Enablement for Apache Spark Setup with Local Development\n\nValue Add:\n• Developers can now rapidly spin up local Spark environments with realistic data schemas through automated helper scripts that fetch and recreate table structures from DCR.\n• Engineering productivity increases significantly as teams no longer need to manually configure complex data schemas for local testing and development.\n\nGeneral Availability",
    "DSP Core PL3": "DSP Core PL3 Release 4.0\n\nCore Chat UI Shell (Cora Tab Only)\n\nValue Add:\n• Enables secure feature rollout capabilities through anonymous client integration with LaunchDarkly platform.\n• Provides foundational access point for Cortex Agent functionality with controlled deployment mechanisms.\n• Delivers enhanced chat interface framework specifically optimized for Cora tab interactions.\n\nGeneral Availability",
    "DSP Core PL1": "DSP Core PL1 Maintenance Q1 2026\n\nValue Add:\n• Resolved critical security vulnerability in di-creative-service to ensure platform stability and data protection.\n\nGeneral Availability\n\nDSP Core PL1 Enhancements Q1 2026\n\nValue Add:\n• Enhanced user workflow efficiency by preserving Status column filter preferences on the Open Orders page.\n• Streamlined order management by automatically clearing order selections when users archive orders.\n• Improved filtering capabilities with multi-select functionality for Status column on Order Listing page.\n\nGeneral Availability\n\nDSP PL1 Enhancements Q4 2025\n\nValue Add:\n• Completed platform optimization by removing legacy feature flags from DSP PL1 Part 3 implementation.\n\nGeneral Availability\n\nForecasting in Ad Groups\n\nValue Add:\n• Enhanced forecasting accuracy with advanced filter extraction for Channel, Device, Inventory, and Creative Unit Length based on associated deals and exchanges.\n• Expanded data capabilities with one-time pixel audience data integration in DCR Clickhouse for improved targeting insights.\n\nFeature Flag",
    "DSP Core PL5": "DSP Core PL5 Release 6.0\n\nGeneric Data Ingestion Framework for Third-Party Verification Partners\n\nValue Add:\n• Updated Peer39 verification rates ensure accurate brand safety scoring and content classification for advertising campaigns.\n• Migration to new rate structure maintains data consistency while leveraging enhanced third-party verification capabilities.\n• 2026 rate implementation provides forward-looking brand safety protection aligned with industry standards.\n\nGeneral Availability\n\nDSP PL5 - General Enhancements 1Q26\n\nValue Add:\n• Automated validation prevents activation of advertising seats that are disconnected from Boostr IO integration.\n• Enhanced order management reduces operational errors and ensures proper system connectivity before campaign launch.\n\nGeneral Availability",
    "Audiences PL2": "Audiences PL2 - 2H 2025 Audience Improvements & Client Requests\n\nValue Add:\n• Enhanced security infrastructure through dedicated IAM user and role provisioning for automated match service operations.\n• Improved system reliability and access control for critical audience matching processes.\n• Streamlined authentication framework supporting scalable audience management workflows.\n\nGeneral Availability"
  },
  "grouped_data": {
    "Developer Experience 2026": {
      "Saarthi Code Reviewer integration across major repositories": [
        "DI-89410",
        "DI-89405",
        "DI-89396",
        "DI-89394",
        "DI-89389",
        "DI-89383",
        "DI-89359",
        "DI-89351",
        "DI-89339",
        "DI-88542",
        "DI-87639"
      ],
      "Mock Data Enablement for Apache Spark setup with local setup": [
        "DI-89015"
      ]
    },
    "DSP Core PL3": {
      "Core Chat UI Shell (Cora Tab Only)": [
        "DI-89232",
        "DI-88040"
      ]
    },
    "DSP Core PL1": {
      "DSP Core PL1 Maintenance Q1 2026": [
        "DI-89225"
      ],
      "DSP Core PL1 Enhancements Q1 2026": [
        "DI-87787",
        "DI-87775",
        "DI-87772"
      ],
      "DSP PL1 Enhancements Q4 2025": [
        "DI-86778"
      ],
      "Forecasting in Ad Groups": [
        "DI-86610",
        "DI-85474"
      ]
    },
    "DSP Core PL5": {
      "Generic Data Ingestion Framework for Third-Party Verification Partners": [
        "DI-88405",
        "DI-85875"
      ],
      "DSP PL5 - General Enhancements 1Q26": [
        "DI-87946"
      ]
    },
    "Audiences PL2": {
      "Audiences PL2 - 2H 2025 Audience Improvements & Client Requests": [
        "DI-86546"
      ]
    }
  }
}