{
  "processed_at": "2026-02-03T18:22:28.572585",
  "source_file": "tickets_export.json",
  "release_summary": "Release 2nd February 2026",
  "ticket_count": 25,
  "product_lines": [
    "Developer Experience 2026",
    "DSP Core PL3",
    "DSP Core PL1",
    "DSP Core PL5",
    "Audiences PL2"
  ],
  "release_versions": {
    "Developer Experience 2026": "Release 6.0",
    "DSP Core PL3": "Release 4.0",
    "DSP Core PL1": "Release 3.0",
    "DSP Core PL5": "Release 6.0",
    "Audiences PL2": "Release 4.0"
  },
  "fix_version_urls": {
    "Developer Experience 2026": "https://deepintent.atlassian.net/projects/DI/versions/17725/tab/release-report-all-issues",
    "DSP Core PL3": "https://deepintent.atlassian.net/projects/DI/versions/17726/tab/release-report-all-issues",
    "DSP Core PL1": "https://deepintent.atlassian.net/projects/DI/versions/16665/tab/release-report-all-issues",
    "DSP Core PL5": "https://deepintent.atlassian.net/projects/DI/versions/17766/tab/release-report-all-issues",
    "Audiences PL2": "https://deepintent.atlassian.net/projects/DI/versions/17649/tab/release-report-all-issues"
  },
  "epic_urls_by_pl": {
    "Developer Experience 2026": {
      "Saarthi Code Reviewer integration across major repositories": "https://deepintent.atlassian.net/browse/DI-87611",
      "Mock Data Enablement for Apache Spark setup with local setup": "https://deepintent.atlassian.net/browse/DI-88192"
    },
    "DSP Core PL3": {
      "Core Chat UI Shell (Cora Tab Only)": "https://deepintent.atlassian.net/browse/DI-86848"
    },
    "DSP Core PL1": {
      "DSP Core PL1 Maintenance Q1 2026": "https://deepintent.atlassian.net/browse/DI-81489",
      "DSP Core PL1 Enhancements Q1 2026": "https://deepintent.atlassian.net/browse/DI-81496",
      "DSP PL1 Enhancements Q4 2025": "https://deepintent.atlassian.net/browse/DI-63608",
      "Forecasting in Ad Groups": "https://deepintent.atlassian.net/browse/DI-68155"
    },
    "DSP Core PL5": {
      "Generic Data Ingestion Framework for Third-Party Verification Partners": "https://deepintent.atlassian.net/browse/DI-88619",
      "DSP PL5 - General Enhancements 1Q26": "https://deepintent.atlassian.net/browse/DI-86333"
    },
    "Audiences PL2": {
      "Audiences PL2 - 2H 2025 Audience Improvements & Client Requests": "https://deepintent.atlassian.net/browse/DI-75222"
    }
  },
  "tldr_by_pl": {
    "Developer Experience 2026": "Major integration effort deploys Saarthi across 10 core repositories including data-jobs, developer UI, reporting services, and gateway components; production OpenWebUI instance integration and automated schema recreation scripts from DCR enhance developer workflow automation.",
    "DSP Core PL3": "Development implements feature flagging infrastructure with anonymous LaunchDarkly client integration; Cortex Agent entry point functionality deployed behind feature flags for controlled rollout.",
    "DSP Core PL1": "Order management enhancements include multi-select status filtering, persistent filter states, and improved selection handling; forecasting capabilities expand with channel, device, and inventory filters based on deal/exchange validation; critical security vulnerability addressed alongside pixel audience data integration in DCR Clickhouse.",
    "DSP Core PL5": "implements updated Peer39 2026 rates across migration rules and rate structures; system now prevents activation of orders with seats separated from Boostr IO integration.",
    "Audiences PL2": "Infrastructure improvements establish new IAM security roles for automated matching services to enhance system reliability and access control."
  },
  "body_by_pl": {
    "Developer Experience 2026": "Saarthi Code Reviewer Integration Across Major Repositories\n\nValue Add:\n• Development teams now have automated code review capabilities integrated across all critical repositories including data-jobs, developer-ui, media-reporting, and gateway services.\n• Code quality and consistency improvements are standardized across the entire platform with production-ready OpenWebUI model integration.\n• Developer productivity increases through intelligent code suggestions and automated review feedback across ten key service repositories.\n\nGeneral Availability\n\nMock Data Enablement for Apache Spark Setup with Local Development\n\nValue Add:\n• Developers can now quickly set up local Apache Spark environments with realistic test data through automated helper scripts.\n• Local development cycles accelerate with seamless table schema recreation capabilities fetched directly from DCR systems.\n\nGeneral Availability",
    "DSP Core PL3": "DSP Core PL3 Release 4.0\n\nCore Chat UI Shell (Cora Tab Only)\n\nValue Add:\n• Introduces secure anonymous client integration with LaunchDarkly for enhanced feature management capabilities.\n• Enables controlled rollout of Cortex Agent functionality through advanced feature flagging controls.\n• Establishes foundational chat interface architecture specifically optimized for Cora tab interactions.\n\nGeneral Availability",
    "DSP Core PL1": "DSP Core PL1 Maintenance Q1 2026\n\nValue Add:\n• Enhanced system security through resolution of critical vulnerability in di-creative-service component.\n• Improved platform stability and compliance with enterprise security standards.\n\nGeneral Availability\n\nDSP Core PL1 Enhancements Q1 2026\n\nValue Add:\n• Streamlined user workflow by preserving Status column filter preferences when reopening Orders page.\n• Improved order management efficiency by automatically clearing selections when orders are archived.\n• Enhanced filtering capabilities with multi-select functionality for Status column on Order Listing page.\n\nGeneral Availability\n\nDSP PL1 Enhancements Q4 2025\n\nValue Add:\n• Simplified platform configuration through removal of legacy DSP PL1 Part 3 feature flags.\n• Reduced technical complexity and improved system maintainability.\n\nGeneral Availability\n\nForecasting in Ad Groups\n\nValue Add:\n• Advanced targeting precision with Channel, Device, Inventory, and Creative Unit Length filter validation based on Deal and Exchange configurations.\n• Enhanced audience insights through integration of one-time Pixel Audience Data in DCR Clickhouse infrastructure.\n\nFeature Flag",
    "DSP Core PL5": "Generic Data Ingestion Framework for Third-Party Verification Partners\n\nValue Add:\n• Updated Peer39 integration now supports 2026 rate structures to ensure accurate brand safety scoring and content verification.\n• Migrated existing rules framework to leverage new Peer39 pricing models for improved cost efficiency and measurement accuracy.\n\nGeneral Availability\n\nDSP PL5 - General Enhancements 1Q26\n\nValue Add:\n• Enhanced order validation now prevents activation of advertising seats that are disconnected from Boostr IO integration.\n• Improved campaign setup workflow reduces configuration errors and ensures proper inventory management alignment.\n\nGeneral Availability",
    "Audiences PL2": "Audiences PL2 - 2H 2025 Audience Improvements & Client Requests\n\nValue Add:\n• Enhanced security and operational efficiency through dedicated IAM infrastructure for automated audience matching processes.\n• Improved system reliability and access control for critical audience data processing workflows.\n\nGeneral Availability"
  },
  "grouped_data": {
    "Developer Experience 2026": {
      "Saarthi Code Reviewer integration across major repositories": [
        "DI-89410",
        "DI-89405",
        "DI-89396",
        "DI-89394",
        "DI-89389",
        "DI-89383",
        "DI-89359",
        "DI-89351",
        "DI-89339",
        "DI-88542",
        "DI-87639"
      ],
      "Mock Data Enablement for Apache Spark setup with local setup": [
        "DI-89015"
      ]
    },
    "DSP Core PL3": {
      "Core Chat UI Shell (Cora Tab Only)": [
        "DI-89232",
        "DI-88040"
      ]
    },
    "DSP Core PL1": {
      "DSP Core PL1 Maintenance Q1 2026": [
        "DI-89225"
      ],
      "DSP Core PL1 Enhancements Q1 2026": [
        "DI-87787",
        "DI-87775",
        "DI-87772"
      ],
      "DSP PL1 Enhancements Q4 2025": [
        "DI-86778"
      ],
      "Forecasting in Ad Groups": [
        "DI-86610",
        "DI-85474"
      ]
    },
    "DSP Core PL5": {
      "Generic Data Ingestion Framework for Third-Party Verification Partners": [
        "DI-88405",
        "DI-85875"
      ],
      "DSP PL5 - General Enhancements 1Q26": [
        "DI-87946"
      ]
    },
    "Audiences PL2": {
      "Audiences PL2 - 2H 2025 Audience Improvements & Client Requests": [
        "DI-86546"
      ]
    }
  }
}