{
  "processed_at": "2026-02-03T18:03:39.004884",
  "source_file": "tickets_export.json",
  "release_summary": "Release 2nd February 2026",
  "ticket_count": 25,
  "product_lines": [
    "DSP Core PL1",
    "Audiences PL2",
    "DSP Core PL3",
    "DSP Core PL5",
    "Developer Experience"
  ],
  "release_versions": {
    "DSP Core PL1": "Release 2",
    "Audiences PL2": "Release 2",
    "DSP Core PL3": "Release 2",
    "DSP Core PL5": "Release 2",
    "Developer Experience": "Release 2"
  },
  "tldr_by_pl": {
    "DSP Core PL1": "Core bidding engine gains real-time optimization and improved budget pacing algorithms; new targeting capabilities include contextual targeting and cross-channel frequency capping; dashboard performance increases 40% for faster campaign monitoring.",
    "Audiences PL2": "Audience targeting enhancements with HCP segment builder featuring NPI targeting and specialty physician filters for cardiology campaigns; patient journey mapping capabilities for oncology audiences with enhanced overlap analysis using Venn diagrams; bulk audience upload functionality via CSV with validation streamlines campaign setup workflows.",
    "DSP Core PL3": "Attribution capabilities expand with cross-device graph matching and multi-touch model configuration; reporting dashboard enhances with custom date ranges, automated scheduling, and resolved export timeouts for large campaigns.",
    "DSP Core PL5": "Core platform adds real-time inventory forecasting and programmatic guaranteed deals for CTV publishers; targeting enhancements include household demographics for OTT campaigns and creative preview capabilities; infrastructure upgrades support VAST 4.2 ad serving standard.",
    "Developer Experience": "New REST and GraphQL APIs enable comprehensive campaign and audience management capabilities; enhanced API reliability through improved rate limiting and webhook notifications for real-time status updates."
  },
  "body_by_pl": {
    "DSP Core PL1": "Bidding Engine Improvements\n\nValue Add:\n• Real-time bidding optimization automatically adjusts campaign strategies to maximize performance and ROI across all active campaigns.\n• Frequency capping prevents ad oversaturation by controlling impression limits across all channels, improving user experience and campaign effectiveness.\n\nGeneral Availability\n\nTargeting Enhancements\n\nValue Add:\n• Contextual targeting capabilities enable more precise audience reach by analyzing page content and environment for better ad placement relevance.\n\nFeature Flag\n\nPerformance Optimization\n\nValue Add:\n• Campaign dashboard performance improvements deliver 40% faster load times, enabling quicker decision-making and enhanced user productivity.\n\nGeneral Availability\n\nBudget Management\n\nValue Add:\n• Enhanced budget pacing algorithm ensures optimal spend distribution during weekend traffic patterns, preventing budget waste and improving campaign consistency.\n\nGeneral Availability",
    "Audiences PL2": "HCP Targeting\n\nValue Add:\n• Build highly targeted healthcare professional audiences using NPI-based physician identification and specialty filters for cardiology campaigns.\n• Map patient journeys specifically for oncology audiences to optimize treatment pathway engagement strategies.\n• Create precise physician segments that align with therapeutic area campaigns and regulatory requirements.\n\nGeneral Availability\n\nAudience Analytics\n\nValue Add:\n• Visualize audience overlap relationships through interactive Venn diagrams to identify segment redundancies and optimize targeting efficiency.\n• Make data-driven decisions about audience consolidation and campaign reach expansion based on clear overlap insights.\n\nGeneral Availability\n\nAudience Management\n\nValue Add:\n• Upload thousands of audience records simultaneously via CSV files with built-in validation to ensure data quality and reduce manual entry time.\n• Scale audience creation processes while maintaining data integrity through automated validation checks.\n\nGeneral Availability",
    "DSP Core PL3": "DSP Core PL3 Release 2\n\nAttribution & Measurement\n\nValue Add:\n• Cross-device graph matching now connects user interactions across multiple devices to provide complete campaign attribution visibility.\n• Multi-touch attribution model configuration enables customizable credit assignment across touchpoints to optimize campaign performance.\n\nGeneral Availability\n\nReporting Enhancements\n\nValue Add:\n• Custom date range selection in reporting dashboards delivers flexible analysis periods tailored to specific campaign timeframes.\n• Automated report scheduling with email delivery streamlines routine reporting workflows and ensures stakeholders receive timely updates.\n• Resolved data export timeouts for large campaign reports to enable comprehensive dataset analysis without interruption.\n\nGeneral Availability",
    "DSP Core PL5": "DSP Core PL5 Release 2\n\nCTV Enhancements\n\nValue Add:\n• Real-time inventory forecasting enables advertisers to optimize CTV campaign planning and budget allocation with accurate availability predictions.\n• Programmatic guaranteed deals provide CTV publishers with premium inventory monetization while offering advertisers brand-safe, guaranteed placements.\n• Creative preview functionality reduces campaign setup time and creative errors by allowing real-time visualization of CTV ad formats before launch.\n\nGeneral Availability\n\nOTT Improvements\n\nValue Add:\n• Enhanced household demographic targeting delivers more precise audience reach for OTT campaigns, improving campaign performance and reducing media waste.\n\nGeneral Availability\n\nAd Serving\n\nValue Add:\n• VAST 4.2 standard support ensures compatibility with the latest video advertising ecosystem and enables access to advanced ad serving features.\n\nGeneral Availability",
    "Developer Experience": "API Enhancements\n\nValue Add:\n• Developers can now manage campaigns programmatically through new REST API endpoints, reducing manual workflow overhead.\n• GraphQL API enables more efficient audience data queries with precise field selection and reduced bandwidth usage.\n• Enhanced rate limiting ensures consistent API performance and reliability during high-traffic periods.\n\nGeneral Availability\n\nDocumentation\n\nValue Add:\n• Updated SDK documentation with practical code examples accelerates developer onboarding and reduces implementation time.\n\nGeneral Availability\n\nIntegration Features\n\nValue Add:\n• Webhook support for campaign status changes enables real-time notifications and automated downstream processes.\n\nGeneral Availability"
  },
  "grouped_data": {
    "DSP Core PL1": {
      "Bidding Engine Improvements": [
        "DI-1001",
        "DI-1002"
      ],
      "Targeting Enhancements": [
        "DI-1003"
      ],
      "Performance Optimization": [
        "DI-1004"
      ],
      "Budget Management": [
        "DI-1005"
      ]
    },
    "Audiences PL2": {
      "HCP Targeting": [
        "DI-2001",
        "DI-2002",
        "DI-2003"
      ],
      "Audience Analytics": [
        "DI-2004"
      ],
      "Audience Management": [
        "DI-2005"
      ]
    },
    "DSP Core PL3": {
      "Attribution & Measurement": [
        "DI-3001",
        "DI-3002"
      ],
      "Reporting Enhancements": [
        "DI-3003",
        "DI-3004",
        "DI-3005"
      ]
    },
    "DSP Core PL5": {
      "CTV Enhancements": [
        "DI-5001",
        "DI-5002",
        "DI-5003"
      ],
      "OTT Improvements": [
        "DI-5004"
      ],
      "Ad Serving": [
        "DI-5005"
      ]
    },
    "Developer Experience": {
      "API Enhancements": [
        "DI-6001",
        "DI-6002",
        "DI-6005"
      ],
      "Documentation": [
        "DI-6003"
      ],
      "Integration Features": [
        "DI-6004"
      ]
    }
  }
}